БылковД.А_70180166/src/Documents/ПротоколЗаседанияКомиссии/ПротоколЗаседанияКомиссии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПротоколЗаседанияКомиссии</name>
  <basedOn>Document.РекомендацииПоСтудентам</basedOn>
  <registerRecords>AccumulationRegister.ДинамикаЛиквидацииЗадолженностей</registerRecords>
  <registerRecords>AccumulationRegister.УспешныеПересдачи</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВозникшихЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛиквидированныхЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РекомендацииПоСтудентам</types>
      <types>DocumentRef</types>
    </type>
  </attributes>
</mdclass:Document>

БылковД.А_70180166/src/AccumulationRegisters/УспешныеПересдачи/УспешныеПересдачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УспешныеПересдачи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоУспешныхПересдач</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БылковД.А_70180166/src/Documents/ВедомостьУчетаАкадемическихЗадолженностей/ВедомостьУчетаАкадемическихЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьУчетаАкадемическихЗадолженностей</name>
  <basedOn>Document.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</basedOn>
  <registerRecords>InformationRegister.ТекущийСтатусЗадолженностей</registerRecords>
  <registerRecords>InformationRegister.ОценкиСтудентов</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтроля</name>
    <type>
      <types>EnumRef.НаименованиеКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>EnumRef.Оценка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусАкадемическойЗадолженности</name>
    <type>
      <types>EnumRef.НаименованиеСтатуса</types>
    </type>
  </attributes>
</mdclass:Document>

БылковД.А_70180166/src/Documents/ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ/ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ</name>
  <basedOn>Document.ИндивидуальныйПланЛиквидацииЗадолженностей</basedOn>
  <registerRecords>InformationRegister.ТекущийСтатусЗадолженностей</registerRecords>
  <registerRecords>InformationRegister.ОценкиСтудентов</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтроля</name>
    <type>
      <types>EnumRef.НаименованиеКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>EnumRef.Оценка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусАкадемическойЗадолженности</name>
    <type>
      <types>EnumRef.НаименованиеСтатуса</types>
    </type>
  </attributes>
</mdclass:Document>

БылковД.А_70180166/src/Catalogs/Студенты/Студенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Студенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтуденческийБилет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправленияПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидФинансирования</name>
    <type>
      <types>EnumRef.ВидыФинансирования</types>
    </type>
  </attributes>
</mdclass:Catalog>

БылковД.А_70180166/src/Documents/ПротоколЗаседанияКомиссии/ObjectModule.bsl
&НаСервере
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
    
    Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РекомендацииПоСтудентам") Тогда
        // Устанавливаем реквизиты документа
        ЭтотОбъект.Студент = ДанныеЗаполнения.Студент;
        ДокументОснование = ДанныеЗаполнения.Ссылка;
               
        // Получаем данные студента из справочника
        ДанныеСтудента = ПолучитьДанныеСтудента(ДокументОснование.Студент);
        
        // Заполняем семестр
        Если ДанныеСтудента.Свойство("Семестр") Тогда
            ЭтотОбъект.Семестр = ДанныеСтудента.Семестр;
        КонецЕсли;
        
        // Заполняем группу
        Если ДанныеСтудента.Свойство("ГруппаСсылка") Тогда
            ЭтотОбъект.Группа = ДанныеСтудента.ГруппаСсылка;
        КонецЕсли;
             
        // Получаем количество возникших задолженностей
        КоличествоВозникших = ПолучитьКоличествоВозникшихЗадолженностей(ДокументОснование.Студент);
        ЭтотОбъект.КоличествоВозникшихЗадолженностей = КоличествоВозникших;
        
        // Получаем количество ликвидированных задолженностей
        КоличествоЛиквидированных = ПолучитьКоличествоЛиквидированныхЗадолженностей(ДокументОснование.Студент);
        ЭтотОбъект.КоличествоЛиквидированныхЗадолженностей = КоличествоЛиквидированных;
        
        // Рассчитываем процент задолженностей
        Если КоличествоВозникших > 0 Тогда
            ПроцентЗадолженностей = (КоличествоВозникших - КоличествоЛиквидированных) / КоличествоВозникших * 100;
            ЭтотОбъект.ПроцентЗадолженностей = Окр(ПроцентЗадолженностей, 2);
        Иначе
            ЭтотОбъект.ПроцентЗадолженностей = 0;
        КонецЕсли;
      
	КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеСтудента(СсылкаНаСтудента) Экспорт
    Результат = Новый Структура;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Студенты.Семестр КАК Семестр,
    |    Студенты.Родитель КАК РодительСправочника,
    |    Студенты.Родитель.Наименование КАК НаименованиеРодителя,
    |    Студенты.ФормаОбучения КАК ФормаОбучения,
    |    Студенты.Наименование КАК Наименование
    |ИЗ
    |    Справочник.Студенты КАК Студенты
    |ГДЕ
    |    Студенты.Ссылка = &СсылкаНаСтудента"; 

    Запрос.УстановитьПараметр("СсылкаНаСтудента", СсылкаНаСтудента);
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();    

    Если Выборка.Следующий() Тогда
        // Заполняем семестр
        Если ЗначениеЗаполнено(Выборка.Семестр) Тогда
            Результат.Вставить("Семестр", Выборка.Семестр);
        КонецЕсли;
        
        // Заполняем группу
        Если ЗначениеЗаполнено(Выборка.РодительСправочника) Тогда
			
			Группа = ОбщиеПроцедурыДляСправочников.НайтиГруппуПоЧастичномуСовпадению(Выборка.НаименованиеРодителя);
                       
            Результат.Вставить("ГруппаСсылка", Группа);
            Результат.Вставить("ГруппаНаименование", Выборка.НаименованиеРодителя);
        КонецЕсли;
        
        Результат.Вставить("НаименованиеСтудента", Выборка.Наименование);
        Результат.Вставить("ФормаОбучения", Выборка.ФормаОбучения);
    КонецЕсли;
    
    Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьКоличествоВозникшихЗадолженностей(Студент)
    
    КоличествоЗадолженностей = 0;
    
    // Считаем все ведомости о задолженностях
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    КОЛИЧЕСТВО(Ведомость.Ссылка) КАК Количество
    |ИЗ
    |    Документ.ВедомостьУчетаАкадемическихЗадолженностей КАК Ведомость
    |ГДЕ
    |    Ведомость.Студент = &Студент";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    
    Попытка
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();
        Если Выборка.Следующий() Тогда
            КоличествоЗадолженностей = Выборка.Количество;
        КонецЕсли;
    Исключение
		
	КонецПопытки;
    
    // Добавляем ведомости для студентов с ИОМ
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    КОЛИЧЕСТВО(ВедомостьИОМ.Ссылка) КАК Количество
    |ИЗ
    |    Документ.ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ КАК ВедомостьИОМ
    |ГДЕ
    |    ВедомостьИОМ.Студент = &Студент";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    
    Попытка
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();
        Если Выборка.Следующий() Тогда
            КоличествоЗадолженностей = КоличествоЗадолженностей + Выборка.Количество;
        КонецЕсли;
    Исключение
		
	КонецПопытки;
    
    Возврат ?(КоличествоЗадолженностей <> Неопределено, КоличествоЗадолженностей, 0);
КонецФункции

&НаСервере
Функция ПолучитьКоличествоЛиквидированныхЗадолженностей(Студент)
    
    КоличествоЛиквидированных = 0;
    
    // Считаем закрытые задолженности из ведомости
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    КОЛИЧЕСТВО(Ведомость.Ссылка) КАК Количество
    |ИЗ
    |    Документ.ВедомостьУчетаАкадемическихЗадолженностей КАК Ведомость
    |ГДЕ
    |    Ведомость.Студент = &Студент
    |    И Ведомость.СтатусАкадемическойЗадолженности = &СтатусЗакрыта";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("СтатусЗакрыта", Перечисления.НаименованиеСтатуса.Закрытая);
    
    Попытка
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();
        Если Выборка.Следующий() Тогда
            КоличествоЛиквидированных = Выборка.Количество;
        КонецЕсли;
    Исключение
		
	КонецПопытки;
    
    // Добавляем закрытые задолженности из ведомости для студентов с ИОМ
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    КОЛИЧЕСТВО(ВедомостьИОМ.Ссылка) КАК Количество
    |ИЗ
    |    Документ.ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ КАК ВедомостьИОМ
    |ГДЕ
    |    ВедомостьИОМ.Студент = &Студент
    |    И ВедомостьИОМ.СтатусАкадемическойЗадолженности = &СтатусЗакрыта";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("СтатусЗакрыта", Перечисления.НаименованиеСтатуса.Закрытая);
    
    Попытка
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();
        Если Выборка.Следующий() Тогда
            КоличествоЛиквидированных = КоличествоЛиквидированных + Выборка.Количество;
        КонецЕсли;
    Исключение
		
	КонецПопытки;
    
    Возврат ?(КоличествоЛиквидированных <> Неопределено, КоличествоЛиквидированных, 0);
КонецФункции

&НаСервере
Процедура ОбработкаПроведения(Отказ, Режим)
    
    // Записываем движения в регистры
    Движения.ДинамикаЛиквидацииЗадолженностей.Записывать = Истина;
    Движение = Движения.ДинамикаЛиквидацииЗадолженностей.Добавить();
    Движение.Период = Дата;
    Движение.Студент = ЭтотОбъект.Студент;
    Движение.Группа = ЭтотОбъект.Группа;
    Движение.Семестр = ЭтотОбъект.Семестр;
    Движение.КоличествоВозникшихЗадолженностей = ЭтотОбъект.КоличествоВозникшихЗадолженностей;
    Движение.КоличествоЛиквидированныхЗадолженностей = ЭтотОбъект.КоличествоЛиквидированныхЗадолженностей;

    Движения.УспешныеПересдачи.Записывать = Истина;
    Движение = Движения.УспешныеПересдачи.Добавить();
    Движение.Период = Дата;
    Движение.Студент = ЭтотОбъект.Студент;
    Движение.Группа = ЭтотОбъект.Группа;
    Движение.КоличествоУспешныхПересдач = ЭтотОбъект.КоличествоЛиквидированныхЗадолженностей;
    
КонецПроцедуры
